{
  "jobs": [
    {
      "place": "Wix",
      "when": "5/2020 - Present",
      "role": "Frontend developer",
      "description": [
        "Working in the website viewer group, in a team responsible for rendering apps within wix websites.",
        "Took part in a major rewrite of the viewer, to improve its performance. On the day-to-day responsible for extending the viewer apis for apps, and investigating performance problems",
        "Mostly writing vanilla typescript, and some react."
      ]
    },
    {
      "place": "Circuit Auction",
      "when": "3/2018 - 4/2020",
      "role": "Full stack developer",
      "description": [
        "Made systems for auction houses management. Handling the online/ room bidding, catalog website, back office & low latency live video broadcasting.",
        "Was responsible for rebuilding the backend for robustness, and for building data migration pipelines from other systems.",
        "Programmed mainly in PHP and Elm in the frontend. CI with phpunit and webdriverio."
      ]
    },
    {
      "place": "OSK Berlin",
      "when": "10/2017 - 3/2018",
      "role": "Backend developer",
      "description": [
        "Worked on a drupal based dashboard comparing social media influencers for the Mercedes division in Daimler.",
        "Was responsible for refactoring the system, and for introducing CI, tests and code reviews."
      ]
    },
    {
      "place": "Gizra",
      "when": "1/2012 - 10/2017",
      "role": "Team lead, Elm & PHP programmer",
      "description": [
        "Was the team lead and a programmer of an early version of Circuit Auction - Which is also my current employer. See above.",
        "Also participated in building <br/> Ethosia - Tech jobs search. <br/> Haskala Library - A book index for the Judaica Division of the Frankfurt University Library."
      ]
    },
    {
      "place": "Innstant",
      "when": "5/2011 - 1/2012",
      "role": "PHP programmer",
      "description": [
        "Worked on an hotel search website, built with Zend framework."
      ]
    },
    {
      "place": "Fairmas",
      "when": "6/2008 - 5/2011",
      "role": "PHP programmer",
      "description": [
        "Worked on an hotels performance comparison system for hotel chains, built with a proprietary MVC framework.",
        "Designed a configuration system for creating new reports. Was responsible for maintenance and adjustments for new hotels."
      ]
    }
  ],
  "education": [
    {
      "place": "The Open University of Israel",
      "when": "2012 - 2016",
      "description": ["Studying for a B.A. in cognitive and computer sciences."]
    }
  ],
  "abilities": [
    {
      "title": "PHP & MySQL",
      "description": [
        "Fluent with OO and procedural PHP, and with MySQL. Did a lot of data modeling, and query optimizations."
      ]
    },
    {
      "title": "Javascript",
      "description": [
        "Experienced with AngularJs & jQuery. Familiar with Typescript, node & express."
      ]
    },
    {
      "title": "Elm",
      "description": [
        "Two years of experience with functional programming and writing Elm SPAs."
      ]
    },
    {
      "title": "Drupal",
      "description": [
        "Contributed to several popular Drupal modules and profiles, including Commerce-Kickstart, Commons, Organic Groups, Restful and Message."
      ]
    },
    {
      "title": "HTML & CSS",
      "description": ["Experienced with Sass, Bootstrap, Semantic UI & HTML5."]
    },
    {
      "title": "Misc.",
      "description": [
        "Experienced with C, Git, Apache, Jenkins, AWS, behat and webdriverio tests. Most comfortable with linux. Knows a little of Haskell and Java.",
        "Fluent in <b>English</b> and <b>Hebrew</b>. Speaks basic <b>German</b>."
      ]
    }
  ]
}
