{
  "jobs": [
    {
      "place": "Wix",
      "when": "5/2020 - Present",
      "role": "Frontend developer - Viewer",
      "description": [
        "Working in a team responsible for rendering apps within Wix websites.",
        "Took part in a major rewrite to improve the website viewer performance. Responsible for extending the apis for apps and user code, and investigating performance problems.",
        "Mostly writing vanilla typescript, and some react."
      ]
    },
    {
      "place": "Circuit Auction",
      "when": "3/2018 - 4/2020",
      "role": "Full stack developer",
      "description": [
        "Saas for auction houses management. Handling the online/ room bidding, catalog website, back office & low latency live video broadcasting.",
        "Was responsible for rebuilding the backend for robustness, and for building data migration pipelines from other systems.",
        "Programmed mainly in PHP, and Elm in the frontend"
      ]
    },
    {
      "place": "OSK Berlin",
      "when": "10/2017 - 3/2018",
      "role": "Backend developer",
      "description": [
        "Worked on a drupal based dashboard comparing social media influencers for the Mercedes division in Daimler.",
        "Was responsible for refactoring the system, and for introducing CI, tests and code reviews."
      ]
    },
    {
      "place": "Gizra",
      "when": "1/2012 - 10/2017",
      "role": "Team lead, Elm & PHP programmer",
      "description": [
        "Was the team lead and a programmer of an early version of Circuit Auction - See above.",
        "Also participated in building many drupal based projects, including:<br/> Ethosia - Tech jobs search. <br/> Haskala Library - A book index for the Judaica Division of the Frankfurt University Library."
      ]
    },
    {
      "place": "Innstant",
      "when": "5/2011 - 1/2012",
      "role": "PHP programmer",
      "description": [
        "Worked on an hotel search website, built with Zend framework."
      ]
    },
    {
      "place": "Fairmas",
      "when": "6/2008 - 5/2011",
      "role": "PHP programmer",
      "description": [
        "Worked on an hotels performance comparison system for hotel chains, built with a proprietary MVC framework.",
        "Designed a configuration system for creating new reports. Was responsible for maintenance and adjustments for new hotels."
      ]
    }
  ],
  "education": [
    {
      "place": "The Open University of Israel",
      "when": "2012 - 2016",
      "description": [
        "Studied for a B.A. in cognitive and computer sciences - WIP"
      ]
    }
  ],
  "abilities": [
    {
      "title": "Javascript",
      "description": [
        "In recent years writing mostly functional <b>typescript</b>. Experienced with <b>react</b>, web workers, webpack & web sockets. Familiar with node & express."
      ]
    },
    {
      "title": "PHP & MySQL",
      "description": [
        "Comfortable with OO and procedural PHP, and with MySQL. Used <b>drupal</b> a lot and contributed to several popular modules and installation profiles."
      ]
    },
    {
      "title": "Elm",
      "description": [
        "Two years of experience with functional programming and writing Elm SPAs."
      ]
    },
    {
      "title": "HTML & CSS",
      "description": ["Experienced with Sass, Bootstrap, Semantic UI & HTML5."]
    },
    {
      "title": "Misc.",
      "description": [
        "Experienced with C, Git, Apache, Jenkins, AWS, Linux, sass, bootstrap.",
        "Fluent in <b>English</b> and <b>Hebrew</b>. Speaks basic <b>German</b>."
      ]
    }
  ]
}
